### 데이터프래임 연산 -3
- 일대일 대응으로 인덱스가 동일한 원소들끼리 연산 수행
- 연산 수행 메서드 활용
- NaN에 대한 값 설정으로 연산 수행이 가능해짐

In [1]:
import pandas as pd
import numpy as np

In [2]:
# [2] 데이터 준비
data={'A':[98,78,np.nan,52],
    'B': [90,70,20,60]}

In [4]:
# [3] DataFrame형태로 변환
df1=pd.DataFrame(data)
df1

      A   B
0  98.0  90
1  78.0  70
2   NaN  20
3  52.0  60

In [5]:
#[4]연산 수행
# -DataFrame+숫자
df1.add(5, fill_value=0)

       A   B
0  103.0  95
1   83.0  75
2    5.0  25
3   57.0  65

In [12]:
#- DataFrame + DataFrame
df1.add(df1+10, fill_value=0)   #->nan끼리의 계산은 fill_value상관 없이 nan

       A    B
0  206.0  190
1  166.0  150
2    NaN   50
3  114.0  130

In [13]:
data2={'A':[98,78,20,52],
    'B': [90,70,20,60]}
df2=pd.DataFrame(data2)
df2

    A   B
0  98  90
1  78  70
2  20  20
3  52  60

In [14]:
df1.add(df2,fill_value=0)

       A    B
0  196.0  180
1  156.0  140
2   20.0   40
3  104.0  120